namespace Grayscale.Kifuwarazusa.Entities.Features
{

    /// <summary>
    /// 星の光。
    /// 
    /// 通常、今の星の位置を示していますが、拡張バージョンでは、前の星の位置も示すようになります。
    /// </summary>
    public interface Starlight
    {

        //Finger Finger { get; }


        /// <summary>
        /// ------------------------------------------------------------------------------------------------------------------------
        /// 先後、升、配役
        /// ------------------------------------------------------------------------------------------------------------------------
        /// </summary>
        Starlightable Now { get; }

    }
}
